tutorials/magnetoconvectionFoam/ashouri_2017/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 1.0e-3;

// Thermal expansion coefficient
beta            0;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              1000;

// Turbulent Prandtl number
Prt             0.85;

// Density
rho             rho [1 -3 0 0 0 0 0] 1000;
// ************************************************************************* //
