tutorials/magnetoconvectionFoam/ashouri_2017/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontandback
    {
        type            empty;
    }

    leftWall
    {
        type            calculated;
        value           $internalField;
    }

    topWall
    {
        type            calculated;
        value           $internalField;
    }

    rightWall
    {
	type		calculated;
	value		$internalField;
    }

    bottomWall
    {
	type		calculated;
	value		$internalField;
    }

    squareObstacle
    {
	type		calculated;
	value		$internalField;
    }
}


// ************************************************************************* //
