tutorials/magnetoconvectionFoam/ashouri_2017/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    frontandback
    {
        type		empty;
    }

    leftWall
    {
        type            fixedValue;
	value		uniform 360;
    }

    topWall
    {
        type            zeroGradient;
    }

    rightWall
    {
	type		fixedValue;
	value		uniform 300;
    }

    bottomWall
    {
	type		zeroGradient;
    }

    squareObstacle
    {
	type		zeroGradient;
    }
}


// ************************************************************************* //
