tutorials/magnetoconvectionFoam/ashouri_2017/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontandback
    {
        type            empty;
    }

    leftWall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    topWall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    rightWall
    {
	type		alphatJayatillekeWallFunction;
	Prt		0.85;
	value		uniform 0;
    }

    bottomWall
    {
	type		alphatJayatillekeWallFunction;
	Prt		0.85;
	value		uniform 0;
    }

    squareObstacle
    {
	type		alphatJayatillekeWallFunction;
	Prt		0.85;
	value		uniform 0;
    }
}


// ************************************************************************* //
