tutorials/magnetoconvectionFoam/ashouri_2017/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontandback
    {
        type		empty;
    }

    leftWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    topWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    rightWall
    {
	type		nutkWallFunction;
	value		uniform 0;
    }

    bottomWall
    {
	type		nutkWallFunction;
	value		uniform 0;
    }

    squareObstacle
    {
	type		nutkWallFunction;
	value		uniform 0;
    }
}


// ************************************************************************* //
